In [1]:
#dataframe

In [4]:
import pandas as pd
print('done')

done

In [5]:
#1d_data = series
#2d_data = Muiltiple series row and column :-DF

In [6]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_built_with_meson', '_config', '_is_numpy_dev', '_libs', '_pandas_datetime_CAPI', '_pandas_parser_CAPI', '_testing', '_typing', '_version_meson', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [7]:
# dataframe

In [8]:
# dict

In [8]:
data = {'Names':['Mohan','Sahil','Deepak','Ayush'],
        'salary':[23456,8765,5678,8786],
        'Address':['Noida','Delhi','Gr noida','Gurgaon']}

In [9]:
pd.DataFrame(data)

    Names  salary   Address
0   Mohan   23456     Noida
1   Sahil    8765     Delhi
2  Deepak    5678  Gr noida
3   Ayush    8786   Gurgaon

In [14]:
#list of list
data = [[1,2,3,4,5,9],
        [2,2,2,2,6,8],
        [3,3,3,3,9,0]]
pd.DataFrame(data,columns=['Col_'+str(i+1) for i in range(len(data[0]))])

   Col_1  Col_2  Col_3  Col_4  Col_5  Col_6
0      1      2      3      4      5      9
1      2      2      2      2      6      8
2      3      3      3      3      9      0

In [16]:
import numpy as np

In [17]:
data = np.full((5,5),5)
pd.DataFrame(data,columns=['Col_'+str(i+1) for i in range(len(data[0]))])

   Col_1  Col_2  Col_3  Col_4  Col_5
0      5      5      5      5      5
1      5      5      5      5      5
2      5      5      5      5      5
3      5      5      5      5      5
4      5      5      5      5      5

In [18]:
data = '''Name, Age, Salary
Ayush,12,87654,
karan,23,98765'''

In [19]:
data.splitlines()

['Name, Age, Salary', 'Ayush,12,87654,', 'karan,23,98765']

In [18]:
d=pd.read_excel(r"C:\Users\ASUS\OneDrive\Desktop\New Microsoft Excel Worksheet.xlsx")

In [19]:
d

   id    name  salary  dept
0   2   Ayush     667    it
1   6      om    2435  aiml
2   0  sanjay    3557    cs
3   7   karan    7654   iot
4   8   shera    9889    ds

In [2]:
#path = '''https://github.com/ayushh1013/Power-bi_dashboard_project/blob/main/super%20sale.pbix'''
#Wpd.read_csv(path)

In [20]:
#pd.ExcelFile(r"").sheet_names

In [28]:
pd.read_excel;(r"C:\Users\ASUS\OneDrive\Desktop\EXCEL FORMULA.ods",sheet_names ='')

'C:\\Users\\ASUS\\OneDrive\\Desktop\\EXCEL FORMULA.ods'

In [21]:
#execute

In [24]:
for i in range(10000):
    exec (f'a_{i} = 100')

In [25]:
a_1

100

In [26]:
a_11

100

In [29]:
all_sheets = pd.ExcelFile(r"C:\Users\ASUS\OneDrive\Desktop\New Microsoft Excel Worksheet.xlsx").sheet_names

In [30]:
for i , value in enumerate(all_sheets):
    exec(f'''table_{i+1} = pd.read_excel(r"C:\\Users\\ASUS\\OneDrive\\Desktop\\New Microsoft Excel Worksheet.xlsx",sheet_name = value)''')

In [33]:
table_1

   id    name  salary  dept
0  67   Ayush     667    it
1   6      om    2435  aiml
2   0  sanjay    3557    cs
3   7   karan    7654   iot
4   8   shera    9889    ds

In [31]:
table_2

   id    name  salary  dept
0  89   Ayush     667    it
1   6      om    2435  aiml
2   0  sanjay    3557    cs
3   7   karan    7654   iot
4   8   shera    9889    ds

In [34]:
table_3

   id    name  salary  dept
0  99   Ayush     667    it
1   6      om    2435  aiml
2   0  sanjay    3557    cs
3   7   karan    7654   iot
4   8   shera    9889    ds